# Brewfile

# Apps 
cask "ghostty"          # Terminal
brew "neovim"           # Editor
cask "orbstack"         # Docker Desktop replacement
cask "google-chrome"
cask "font-victor-mono-nerd-font"

# Networking 
brew "httpie"           # curl replacement
brew "htop"             # Process viewer (Consider 'btop' for a newer alternative)

# Shell
brew "starship"         # Prompt
brew "eza"              # ls replacement (includes tree)
brew "zoxide"           # cd replacement
brew "ripgrep"          # grep replacement (required for nvim telescope)
brew "fd"               # find replacement (required for nvim telescope)
brew "sd"               # sed replacement
brew "fzf"              # Fuzzy finder
brew "stow"             # Dotfile management
brew "bat"              # cat replacement
brew "glow"             # Markdown renderer for terminal
brew "tldr"             # man page replacement
brew "dust"             # du replacement (disk usage)
brew "jq"               # JSON processor


# Coding
brew "git"
brew "gh"               # GitHub CLI
brew "git-delta"        # Better git diffs
brew "lazygit"          # TUI for Git (Goated tool)
brew "fnm"              # Node manager
brew "elm"
brew "elm-format"
brew "tokei"            # code statistics

